content/information-science/2022-d37970ce-9dcd-6534-422b-1df7983164bc.md
+++
title = "電子書籍リーダで読みやすくするために、サイズを変えずにPDFの余白をバッサリとる"
author = ["ROCKTAKEY"]
date = 2022-02-01T17:43:00+09:00
lastmod = 2022-02-01T17:44:17+09:00
tags = ["PDF", "e-book"]
draft = false
+++

## 結論 {#結論}

下記URLにある `pdfcrop.sh` をつかう。 `pdfcrop.sh -m 0 input.pdf output.pdf` 。
<https://tex.stackexchange.com/questions/42236/pdfcrop-generates-larger-file>


## はじめに {#はじめに}

電子書籍リーダで読む場合、LaTeXで吐いたPDFとかだと、あきらかに余白が大きい。
製本するならそれでもよいが、電子書籍リーダで読むなら余白は邪魔なだけだ。
これをばっさりなくしたい。


## pdfcrop {#pdfcrop}

余白をバッサリとってくれるツールとして、 `pdfcrop` というものがある。
TeX系のユーティリティとしてついてくる。しかしこのツールには問題があり、
ページ数の多いものなど、一部のPDFを異常に大きなサイズとしてしまう。
Send-to-kindleだと50MBまでしか送れないし、そもそも電子書籍リーダはたいして容量がないので、
あまりよろしくない。ちなみに私が使ったときはサイズが20倍とかに膨れ上がった。


## 解決 {#解決}

解決法をさがしていたところ、以下のStackExchangeに出会った。

<https://tex.stackexchange.com/questions/42236/pdfcrop-generates-larger-file>

ここに載っている `pdfcrop.sh` を保存して使うと、みごとに余白を削れた。もちろんサイズは変わっていない。
丁寧に作られていて、helpもあるので詳しくはそれを参照してほしいが、基本的な使いかたは、 `-m` で
空白(margin)のサイズを指定し、引数として入力PDFと出力PDFを与える。
余白をまったくなくしたければ、 `pdfcrop.sh -m 0 input.pdf output.pdf` とすればよい。


## おわりに {#おわりに}

ま、まだ電子書籍リーダもってないんですけどね。Fire HD 8しかない。おすすめおしえてほしい。
